#ex1--------------------------------------------------------------------------------------------------

try: 
    print("----------------------------------ХОД ЛАДЬИ----------------------------------")
    x1=int(input("Введите координаты горизонтали первой клетки: "))
    y1=int(input("Введите координаты вертикали первой клетки: "))

    x2=int(input("Введите координаты горизонтали второй клетки: "))
    y2=int(input("Введите координаты вертикали второй клетки: "))

    if x1 > 8 or x2 > 8 or y1 > 8 or y2 > 8:
        raise ValueError
    elif x1 <= 0 or x2 <= 0 or y1 <= 0 or y2 <= 0:
        raise ValueError

    if x1 - x2 == y1 - y2 or x1 == x2 or y1 == y2:
        print(f"Ферзь может попасть с {x1, y1} на {x2, y2} одним ходом.")
    else:
        print(f"Ферзь не может попасть с {x1, y1} на {x2, y2} одним ходом.")


    print("----------------------------------ХОД КОНЯ----------------------------------")

    x1_k = int(input("Введите координаты горизонтали первой клетки: "))
    y1_k = int(input("Введите координаты вертикали первой клетки: "))
    x2_k = int(input("Введите координаты горизонтали второй клетки: "))
    y2_k = int(input("Введите координаты вертикали второй клетки: "))

    if x1_k > 8 or x2_k > 8 or y1_k > 8 or y2_k > 8:
        raise ValueError
    elif x1_k <= 0 or x2_k <= 0 or y1_k <= 0 or y2_k <= 0:
        raise ValueError

    if (x1_k - 1 == x2_k or x1_k + 1 == x2_k) and (y1_k - 2 == y2_k or y1_k + 2 == y2_k):
        print (f"Конь может попасть с {x1_k, y1_k} на {x2_k, y2_k} одним ходом.")
    elif (x1_k - 2 == x2_k or x1_k + 2 == x2_k) and (y1_k - 1 == y2_k or y1_k + 1 == y2_k):
        print (f"Конь может попасть с {x1_k, y1_k} на {x2_k, y2_k} одним ходом.")
    else:
        print (f"Конь не может попасть с {x1_k, y1_k} на {x2_k, y2_k} одним ходом.")

except ValueError:
    print("Не верные кооринаты")


#ex2--------------------------------------------------------------------------------------------------

try:
    two=2
    number=int(input('Введите число: '))
    def plus_two(num):
        return 2+ num
    print(plus_two(number))
except ValueError:
    print("Ожидаемый тип данных — число!")


#ex3--------------------------------------------------------------------------------------------------


try:
    lst=[1, 2, 3, 4, 5]
    index=int(input("Индекс элемента: "))
    result = lst[index]
    print(f"Значение элемента с индексом {index}: {result}")
except IndexError:
    print(f"Индекс {index} выходит за границы массива.")
